esp-cpp/espp/components/usb_host/tab5_example/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 16 MB flash on the Tab5
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# The Tab5's ESP32-P4 chip revision
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144
CONFIG_FREERTOS_HZ=1000

# The console stays on USB-Serial-JTAG: on the Tab5 that is the USB-C port
# (the P4's full-speed USB-OTG controller), while the USB-A host jack is on the
# separate high-speed controller the USB Host Library uses by default.

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_OFFSET=0x9000
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Tab5 BSP: the interrupt task runs the touch I2C reads + fmt logging
CONFIG_M5STACK_TAB5_INTERRUPT_STACK_SIZE=8192

# PSRAM (32 MB on the Tab5; the full-frame LVGL draw buffer lives here)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# LVGL's built-in allocator pool: the virtual keyboard alone is ~130 objects
# with labels and styles, well past the 64 KB default (an exhausted pool makes
# lv_malloc return NULL and LVGL's assert handler spin, which the task watchdog
# then reports on the main task). The P4 has the internal RAM for a bigger pool.
CONFIG_LV_MEM_SIZE_KILOBYTES=256

# LVGL: dark theme + the fonts the UI uses
CONFIG_LV_DEF_REFR_PERIOD=16
CONFIG_LV_USE_THEME_DEFAULT=y
CONFIG_LV_THEME_DEFAULT_DARK=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_UNSCII_16=y
